tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rukenshia/repo"
# Generic library support script
brew "libtool"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# GNU database manager
brew "gdbm"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Perl compatible regular expressions library
brew "pcre"
# Configurable talking characters in ASCII art
brew "cowsay"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Functional programming language for building browser-based GUIs
brew "elm"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# ASN.1 structure parser library
brew "libtasn1"
# SSL/TLS cryptography library
brew "openssl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Library for USB device access
brew "libusb"
# Version Control Visualization Tool
brew "gource"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# The Haskell Tool Stack
brew "haskell-stack"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GNOME XML library
brew "libxml2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Swiss Army Knife for macOS
brew "m-cli"
# Scalable distributed version control system
brew "mercurial"
# Merge XCode project files in git
brew "mergepbx"
# Modern and intuitive terminal-based text editor
brew "micro"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Password manager
brew "pass"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
# Access, manage & use STS token for federated access into AWS using SAML2
brew "rukenshia/repo/saml2aws-auto"
cask "1password"
cask "alfred"
cask "android-studio"
cask "atom"
cask "bartender"
cask "bettertouchtool"
cask "divvy"
cask "docker"
cask "flux"
cask "fly"
cask "freedome"
cask "gitkraken"
cask "grammarly"
cask "hyper"
cask "insomnia"
cask "iterm2"
cask "kaleidoscope"
cask "kap"
cask "obs"
cask "postgres"
cask "postico"
cask "postman"
cask "redis"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "telegram-desktop"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zeplin"
