brew "act"
brew "actionlint"
brew "age"
brew "argocd"
brew "ast-grep"
brew "awscli-local"
brew "awscli"
brew "bat"
brew "boost"
brew "btop"
brew "claude-squad"
brew "cloc"
brew "cmatrix"
brew "common-fate/granted/granted"
brew "container"
brew "cowsay"
brew "cypher-shell"
brew "depot/tap/depot"
brew "diff-so-fancy"
brew "difftastic"
brew "dive"
brew "edencommon"
brew "eza"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fizz"
brew "folly"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git-branchless"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-town"
brew "git"
brew "gitleaks"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "gobject-introspection"
brew "gource"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jpeg-xl"
brew "jq"
brew "krb5"
brew "kubectx"
brew "kubeseal"
brew "libass"
brew "libbluray"
brew "libgsf"
brew "libheif"
brew "libimobiledevice"
brew "libplist"
brew "libtasn1"
brew "libtool"
brew "libusb"
brew "libusbmuxd"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "localstack"
brew "lolcat"
brew "m-cli"
brew "micro"
brew "mintoolkit"
brew "mise"
brew "ncdu"
brew "netpbm"
brew "nghttp2"
brew "nmap"
brew "nnn"
brew "open-mpi"
brew "openfga/tap/fga"
brew "openjdk"
brew "openvino"
brew "pango"
brew "pass"
brew "pcre2"
brew "pinact"
brew "pipenv"
brew "pkgconf"
brew "poppler"
brew "postgresql@14"
brew "protolint"
brew "pstree"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "qt"
brew "redis"
brew "ripgrep"
brew "sdl2_image"
brew "shellcheck"
brew "sops"
brew "srt"
brew "starship"
brew "stow"
brew "tesseract"
brew "thefuck"
brew "tilt"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "unbound"
brew "wangle"
brew "watchman"
brew "webp"
brew "websocat"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zizmor"
cask "1password-cli"
cask "1password"
cask "aerial"
cask "audacity"
cask "bruno"
cask "cloudflare-warp"
cask "container"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "jordanbaird-ice"
cask "linear-linear"
cask "lunar"
cask "ngrok"
cask "notion-calendar"
cask "notion"
cask "obs"
cask "orbstack"
cask "postico"
cask "raycast"
cask "react-native-debugger"
cask "readdle-spark"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zed"
cask "zoom"
tap "1password/tap"
tap "common-fate/granted"
tap "depot/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "openfga/tap"
tap "yoheimuta/protolint"
vscode "1password.op-vscode"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adamcowley.neo4j-vscode"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "andischerer.theme-atom-one-dark"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeque.codeque"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elmtooling.elm-ls-vscode"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "graphite.gti-vscode"
vscode "graphql.vscode-graphql-syntax"
vscode "graphql.vscode-graphql"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "iliazeus.vscode-ansi"
vscode "jakeboone02.cypher-query-language"
vscode "jasonnutter.vscode-codeowners"
vscode "joeberria.statusbarerror"
vscode "jtr.vscode-position"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liamhammett.inline-parameters"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "neo4j-extensions.neo4j-for-vscode"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "robbowen.synthwave-vscode"
vscode "rooveterinaryinc.roo-cline"
vscode "ryanluker.vscode-coverage-gutters"
vscode "semanticdiff.semanticdiff"
vscode "shanoor.vscode-nginx"
vscode "socketsecurity.vscode-socket-security"
vscode "sodatea.velocity"
vscode "softwaredotcom.music-time"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "teamhub.teamhub"
vscode "tilt-dev.tiltfile"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "tomrijndorp.find-it-faster"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vmware.vscode-concourse"
vscode "waderyan.gitblame"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "young-vform.copy-hover-type"
vscode "zxh404.vscode-proto3"
